# Определите количество принадлежащих отрезку [2 × 2^10 ; 4 × 10^10] натуральных чисел,
# которые делятся на 7 и на 100 000 и при этом не делятся на 13,29,49 и 101,
# а также наименьшее из таких чисел.
# В ответе запишите два целых числа: сначала количество, затем наименьшее из них.

num = 0
for i in range(700000, 4 * (10 ** 10), 7 * (10 ** 5)):
    if i % 7 == 0 and i % 13 != 0 and i % 29 != 0 and i % 49 != 0 and i % 101 != 0:
        num += 1
print(num, 700000)
